#ПОКА нашлось (19) ИЛИ нашлось (399) ИЛИ нашлось (999)
#ЕСЛИ нашлось (19)
#ТО заменить (19, 9)
#КОНЕЦ ЕСЛИ
#ЕСЛИ нашлось (399)
#ТО заменить (399, 91)
#КОНЕЦ ЕСЛИ
#ЕСЛИ нашлось (999)
#ТО заменить (999, 3)

for n in range(3,10001):
    s = '1' + n * '9'
    while '19' in s or '399' in s or '999' in s:
        if '19' in s:
            s = s.replace('19', '9', 1)
        if '399' in s:
            s = s.replace('399', '91', 1)
        if '999' in s:
            s = s.replace('999', '3', 1)
    # print(n, s)
    if s.count('1') + (s.count('3') * 3) + (s.count('9') * 9) == 33:
        print(n)
        break