
# Сколько существует целых значений числа A, при которых формула
#
# ((x < 6) → (x^2 < A)) ∧ ((y^2 ≤ A) → (y ≤ 6))
#
# тождественно истинна при любых целых неотрицательных x и y?

otv = []
for A in range(0, 100):
    k = 0
    for x in range(300):
        for y in range(300):
            if ((x < 6) <= ((x**2) < A)) and (((y**2) <= A) <= (y <= 6)):
                k += 1
    if k == 90000:
        otv.append(A)
print(len(otv))