#Сколько существует целых значений числа A, при которых формула
#((x < 6) → (x^2 < A)) ∧ ((y^2 ≤ A) → (y ≤ 6))
#тождественно истинна при любых целых неотрицательных x и y?
c = 0
for A in range(1000):
    k = 0
    for x in range(0,300):
        for y in range(0, 300):
            f = ((x < 6) <= (x ** 2 < A)) and ((y ** 2 <= A) <= (y <= 6))
            if f == 1:
                k += 1
    if k == 90000:
        c += 1
print(c)