# F(0) = 0
# F(n) = F(n - 1) + n
# Укажите количество таких чисел n из интервала 237567892⩽n⩽1134567004, для которых F(n) не делится без остатка на 3.

# n = 5
# F(5 - 1) + 5
# n = 4
# F(3) + 4
# n = 3
# F(2) + 3
# n = 2
# F(1) + 2
# n = 1
# F(0) + 1
# n = 0
# return 0

# 1 2 3 4  5  6   7  8   9 - n
# 1 2 0 1  2  0   1  2   0 - n % 3

# 1 3 6 10 15 21 28 36  45  - F(n)
# 1 0 0 1  0  0  1  0   0   - F(n) % 3

c = 0
for n in range(237567892, 1134567004 + 1):
    if n % 3 == 1:
        c += 1
print(c)